In [1]:
import pandas as pd
import numpy as np

In [2]:
#To create and display a one-dimensional array-like object containing an array of data using Pandas module.
array = pd.Series(["apple",1,"Banana",np.nan,5])
array

0     apple
1         1
2    Banana
3       NaN
4         5
dtype: object

In [3]:
array.name = "1D array"

In [4]:
array

0     apple
1         1
2    Banana
3       NaN
4         5
Name: 1D array, dtype: object

In [8]:
#Write a Python program to convert a Panda module Series to Python list and it's type.
data = pd.Series([10,20,30,40,50])
print("data type : ", type(data))
python_list = data.tolist()
print(type(python_list))

data type :  <class 'pandas.core.series.Series'>
<class 'list'>

In [12]:
#Write a Python program to add, subtract, multiple and divide two Pandas Series.
#Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]
series1 = pd.Series([2, 4, 6, 8, 10])
series2 = pd.Series([1, 3, 5, 7, 9])

addition = series1 + series2
subtraction = series1 - series2
multiplication = series1 * series2
division = series1 / series2

print(f"Addition : \n{addition}")
print(f"Subtraction : \n{subtraction}")
print(f"Multiplication : \n{multiplication}")
print(f"Division : \n{division}")

Addition :
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtraction :
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiplication :
0     2
1    12
2    30
3    56
4    90
dtype: int64
Division :
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [17]:
#program to create and display a DataFrame from a specified dictionary data which has the index labels.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df.index = labels
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [18]:
# program to display a summary of the basic information about a specified Data Frame and its data.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew','Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
            }
df = pd.DataFrame(exam_data)
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df.index = labels

In [19]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [20]:
df.shape

(10, 4)

In [21]:
df.describe()

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

In [22]:
df.isnull().sum()

name        0
score       2
attempts    0
qualify     0
dtype: int64

In [23]:
df.dropna()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [26]:
df.fillna(df["score"].mean())

        name    score  attempts qualify
a  Anastasia  12.5000         1     yes
b       Dima   9.0000         3      no
c  Katherine  16.5000         2     yes
d      James  13.5625         3      no
e      Emily   9.0000         2      no
f    Michael  20.0000         3     yes
g    Matthew  14.5000         1     yes
h      Laura  13.5625         1      no
i      Kevin   8.0000         2      no
j      Jonas  19.0000         1     yes

In [1]:
import pandas as pd
import numpy as np

In [2]:
#Python program to get the first 3 rows of a given DataFrame.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew','Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df.index = labels
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [3]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [4]:
#Python program to select the 'name' and 'score' columns from the following DataFrame.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew','Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df.index = labels
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [5]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [7]:
#Python program to select the specified columns and rows from a given data frame.
#Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame
df.loc[['b', 'd', 'f', 'g'], ['name', 'score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [9]:
#Write a Python program to select the rows where the number of attempts in the examination is greater than 2.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [10]:
result_df = df[df['attempts'] > 2]
result_df

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [11]:
#Write a Python program to count the number of rows and columns of a DataFrame
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [13]:
df.shape

(10, 4)

In [14]:
rows, columns = df.shape
print(f"Rows : {rows}, Columns : {columns}")

Rows : 10, Columns : 4

In [15]:
#Write a Python program to select the rows where the score is missing, i.e. is NaN.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [22]:
result_df = df[df['score'].isna()]

In [23]:
result_df

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [26]:
#Write a Python program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.
result_df = df[(df['attempts'] < 2) & (df['score'] > 15)]
result_df

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [27]:
#Write a Python program to change the score in row 'd' to 11.5.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index = labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [31]:
df.loc['d', 'score'] = 11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [32]:
#Write a Python program to calculate the sum of the examination attempts by the students.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index = labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [33]:
sum_attempts = df['attempts'].sum()

In [34]:
sum_attempts

19

In [35]:
#Write a Python program to calculate the mean score for each different student in DataFrame.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index = labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [36]:
mean = df['score'].mean()

In [37]:
mean

13.5625

In [38]:
#Write a Python program to append a new row 'k' to data frame with given values for each column
df.loc['k'] = ['Suresh', 15.5, 1, "yes"]
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [39]:
df.drop('k', inplace = True)

In [40]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [41]:
#Write a Python program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index = labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [42]:
sorted_df = df.sort_values(by = ['name', 'score'], ascending = [False, True])
sorted_df

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [56]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
             'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

# Create DataFrame
df = pd.DataFrame(exam_data, index=labels)

# Replace yes/no with True/False
df['qualify'] = df['qualify'].replace({'yes': True, 'no': False})

# Display result
print(df)

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [59]:
#Write a Python program to delete the 'attempts' column from the DataFrame.
df.drop('attempts', axis = 1,inplace = True)

In [60]:
df

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

In [61]:
df['attempts'] = [1, 3, 2, 3, 2, 3, 1, 1, 2, 1]

In [62]:
df

        name  score  qualify  attempts
a  Anastasia   12.5     True         1
b       Dima    9.0    False         3
c  Katherine   16.5     True         2
d      James    NaN    False         3
e      Emily    9.0    False         2
f    Michael   20.0     True         3
g    Matthew   14.5     True         1
h      Laura    NaN    False         1
i      Kevin    8.0    False         2
j      Jonas   19.0     True         1

In [63]:
#Write a Python program to iterate over rows in a DataFrame
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [67]:
#To iterate over the rows
for index, row in df.iterrows():
    print(f"Index : {index}")
    print(f"Name : {row['name']}")
    print(f"Score : {row['score']}")
    print("---------")

Index : a
Name : Anastasia
Score : 12.5
---------
Index : b
Name : Dima
Score : 9.0
---------
Index : c
Name : Katherine
Score : 16.5
---------
Index : d
Name : James
Score : nan
---------
Index : e
Name : Emily
Score : 9.0
---------
Index : f
Name : Michael
Score : 20.0
---------
Index : g
Name : Matthew
Score : 14.5
---------
Index : h
Name : Laura
Score : nan
---------
Index : i
Name : Kevin
Score : 8.0
---------
Index : j
Name : Jonas
Score : 19.0
---------

In [68]:
columns_list = df.columns.tolist()

In [69]:
columns_list

['name', 'score', 'attempts', 'qualify']

In [70]:
!pip install faker

Collecting faker
  Obtaining dependency information for faker from https://files.pythonhosted.org/packages/46/ec/91a434c8a53d40c3598966621dea9c50512bec6ce8e76fa1751015e74cef/faker-40.1.2-py3-none-any.whl.metadata
  Downloading faker-40.1.2-py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: tzdata in c:\users\palla\anaconda3\lib\site-packages (from faker) (2023.3)
Downloading faker-40.1.2-py3-none-any.whl (2.0 MB)
   ---------------------------------------- 0.0/2.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/2.0 MB ? eta -:--:--
   - -------------------------------------- 0.1/2.0 MB 1.5 MB/s eta 0:00:02
   --- ------------------------------------ 0.2/2.0 MB 1.7 MB/s eta 0:00:02
   ------ --------------------------------- 0.3/2.0 MB 2.1 MB/s eta 0:00:01
   -------- ------------------------------- 0.4/2.0 MB 2.3 MB/s eta 0:00:01
   ----------- ---------------------------- 0.6/2.0 MB 2.3 MB/s eta 0:00:01
   ------------- -------------------------- 0.7/2.0 MB 2.2 MB/s eta 0:00:01
   ---------------- ----------------------- 0.8/2.0 MB 2.5 MB/s eta 0:00:01
   ------------------- -------------------- 1.0/2.0 MB 2.4 MB/s eta 0:00:01
   ---------------------- ----------------- 1.1/2.0 MB 2.5 MB/s eta 0:00:01
   ------------------------ --------------- 1.2/2.0 MB 2.6 MB/s eta 0:00:01
   --------------------------- ------------ 1.4/2.0 MB 2.6 MB/s eta 0:00:01
   ------------------------------- -------- 1.6/2.0 MB 2.7 MB/s eta 0:00:01
   --------------------------------- ------ 1.6/2.0 MB 2.7 MB/s eta 0:00:01
   ----------------------------------- ---- 1.8/2.0 MB 2.7 MB/s eta 0:00:01
   ------------------------------------- -- 1.9/2.0 MB 2.7 MB/s eta 0:00:01
   ---------------------------------------- 2.0/2.0 MB 2.7 MB/s eta 0:00:00
Installing collected packages: faker
Successfully installed faker-40.1.2

In [71]:
from faker import Faker

In [72]:
import pandas as pd

fake = Faker()

data = []

for _ in range(100):
    data.append({
        "name": fake.name(),
        "email": fake.email(),
        "city": fake.city(),
        "age": fake.random_int(min=18, max=60),
        "joined_date": fake.date_this_decade()
    })

df = pd.DataFrame(data)
df.head()

,name,email,city,age,joined_date
0,David Mcintosh,christopher25@example.net,Wilsonchester,18,2025-01-16
1,Sharon Mills,vhansen@example.org,North Thomasville,31,2023-08-02
2,Samantha Henry,brownjennifer@example.net,Smithview,48,2021-10-09
3,John Rodriguez,heidi93@example.net,Lake Carmenview,29,2024-01-11
4,Michael Daniel,diane60@example.net,East Adamshire,42,2020-04-14

In [73]:
df.to_csv("Dummy_data.csv", index = False)

In [75]:
fake = Faker()
data = []
for _ in range(101):
    data.append({
        "name" : fake.name(),
        "email" : fake.email(),
        "city" : fake.city(),
        "age" : fake.random_int(min=18, max=60)
    })
    
df = pd.DataFrame(data)

In [76]:
df.to_csv("Dummy.csv", index = False)

In [77]:
data = pd.read_csv("Dummy.csv")
data.head()

               name                     email              city  age
0     William Scott      xavier53@example.com   East Henryhaven   44
1     Brian Hancock  thomasromero@example.com  Lake Teresamouth   39
2   Michael Rosario       tyler36@example.net        Cohenmouth   27
3   Nicholas Krause       rmeyers@example.org         Caseyberg   54
4  Patricia Coleman   christine80@example.org  South Brianshire   54